       IDENTIFICATION DIVISION.
       PROGRAM-ID. WELCOME.

       DATA DIVISION.
       LINKAGE SECTION.
       01 L-USER-NAME        PIC X(20).

       PROCEDURE DIVISION USING L-USER-NAME.
           DISPLAY "Welcome, " L-USER-NAME
           EXIT PROGRAM.
