       IDENTIFICATION DIVISION.
       PROGRAM-ID. CALCULATE-AVERAGE.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-SUM PIC 9(4) VALUE ZERO.
       01  IDX     PIC 9 VALUE 1.

       LINKAGE SECTION.
       01  C-SCORES.
           05  C-SCORE OCCURS 3 TIMES PIC 9(3).
       01  C-AVERAGE PIC 9(3)V9(2).



       PROCEDURE DIVISION USING C-SCORES, C-AVERAGE.
       CALC-AVG-PARA.
           MOVE 0 TO WS-SUM
           PERFORM VARYING IDX FROM 1 BY 1 UNTIL IDX > 3
               ADD C-SCORE(IDX) TO WS-SUM
           END-PERFORM
           COMPUTE C-AVERAGE = WS-SUM / 3
           EXIT PROGRAM.
