       IDENTIFICATION DIVISION.
       PROGRAM-ID. CALC-GROSS.
       DATA DIVISION. 
       LINKAGE SECTION.
       01  CG-BASIC     PIC 9(5)V99.
       01  CG-ALLOW     PIC 9(4)V99.
       01  CG-GROSS     PIC 9(6)V99.

       PROCEDURE DIVISION USING CG-BASIC, CG-ALLOW, CG-GROSS.
       CALC-GROSS-PARA.
           ADD CG-BASIC TO CG-ALLOW GIVING CG-GROSS
           GOBACK.
