       IDENTIFICATION DIVISION.
       PROGRAM-ID. CALC-NET.
       DATA DIVISION. 
       LINKAGE SECTION.
       01  CN-GROSS     PIC 9(6)V99.
       01  CN-DEDUCT    PIC 9(4)V99.
       01  CN-NET       PIC 9(6)V99.

       PROCEDURE DIVISION USING CN-GROSS, CN-DEDUCT, CN-NET.
       CALC-NET-PARA.
           SUBTRACT CN-DEDUCT FROM CN-GROSS GIVING CN-NET
           GOBACK.
