       IDENTIFICATION DIVISION.
       PROGRAM-ID. INTEREST-ALT1.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  PRINCIPAL             PIC 9(5)V99 VALUE 1000.00.
       01  RATE                  PIC 99V99   VALUE 05.00.
       01  TIMECOUNT                  PIC 9       VALUE 3.
       01  TEMP1                PIC 9(5)V99.
       01  TEMP2                PIC 9(5)V99.
       01  SIMPLE-INTEREST      PIC 9(5)V99 VALUE 0.
       01  COMPOUND-FACTOR      PIC 9(3)V9(6) VALUE 1.000000.
       01  TEMP-MULTIPLIER      PIC 9(1)V9(6) VALUE 1.050000.
       01  COUNTER              PIC 9       VALUE 1.
       01  COMPOUND-INTEREST    PIC 9(5)V99 VALUE 0.

       PROCEDURE DIVISION.
       BEGIN.

           MULTIPLY PRINCIPAL BY RATE GIVING TEMP1
           MULTIPLY TEMP1 BY TIMECOUNT GIVING TEMP2
           DIVIDE TEMP2 BY 100 GIVING SIMPLE-INTEREST

           PERFORM UNTIL COUNTER > TIMECOUNT
               MULTIPLY COMPOUND-FACTOR BY TEMP-MULTIPLIER
                   GIVING COMPOUND-FACTOR
               ADD 1 TO COUNTER
           END-PERFORM

           MULTIPLY PRINCIPAL BY COMPOUND-FACTOR GIVING TEMP1
           COMPUTE TEMP1 ROUNDED = COMPOUND-FACTOR * PRINCIPAL
           COMPUTE COMPOUND-INTEREST ROUNDED = TEMP1 - PRINCIPAL


           DISPLAY "Simple Interest is     : " SIMPLE-INTEREST
           DISPLAY "Compound Interest is   : " COMPOUND-INTEREST
           STOP RUN.
