       IDENTIFICATION DIVISION.
       PROGRAM-ID. ACCOUNT-BALANCE-COMPUTE.

       DATA DIVISION.
       WORKING-STORAGE SECTION.

       01  ACCOUNT-BALANCE        PIC 9(4)V99  VALUE 1000.00.
       01  DEPOSIT-AMOUNT         PIC 9(3)V99  VALUE  250.00.
       01  WITHDRAWAL-AMOUNT      PIC 9(3)V99  VALUE  100.00.


       01  DISPLAY-BALANCE        PIC 9(4).99.
       01  DISPLAY-DEPOSIT        PIC 9(3).99.
       01  DISPLAY-WITHDRAWAL     PIC 9(3).99.
       01  DISPLAY-FINAL          PIC 9(4).99.

       PROCEDURE DIVISION.
       BEGIN.

           MOVE ACCOUNT-BALANCE   TO DISPLAY-BALANCE
           MOVE DEPOSIT-AMOUNT    TO DISPLAY-DEPOSIT
           MOVE WITHDRAWAL-AMOUNT TO DISPLAY-WITHDRAWAL

           DISPLAY "Initial Balance : " DISPLAY-BALANCE
           DISPLAY "Deposited       : " DISPLAY-DEPOSIT
           DISPLAY "Withdrawn       : " DISPLAY-WITHDRAWAL


           COMPUTE ACCOUNT-BALANCE = ACCOUNT-BALANCE + DEPOSIT-AMOUNT - 
           WITHDRAWAL-AMOUNT

   
           MOVE ACCOUNT-BALANCE TO DISPLAY-FINAL
           DISPLAY "Final Balance   : " DISPLAY-FINAL

           STOP RUN.
